Public Attributes | List of all members
API_OpeningOutlinesParameters Struct Reference
Element Manager API
Opening outlines parameters. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_OpeningFloorPlanOutlinesStyleTypeID  | outlinesStyle
Type of contours on open edges.
bool  | useLineOfCutElements
Use contours of cut elements.
API_AttributeIndex  | uncutLineIndex
Uncut line.
API_AttributeIndex  | overheadLineIndex
Overhead line.
short  | uncutLinePenIndex
Uncut line pen.
short  | overheadLinePenIndex
Overhead line pen.
Detailed Description
Opening outlines parameters.
Member Data Documentation
◆ outlinesStyle
 API_OpeningOutlinesParameters::outlinesStyle
Type of contours on open edges.
◆ overheadLineIndex
 API_OpeningOutlinesParameters::overheadLineIndex
Overhead line.
◆ overheadLinePenIndex
 API_OpeningOutlinesParameters::overheadLinePenIndex
Overhead line pen.
◆ uncutLineIndex
 API_OpeningOutlinesParameters::uncutLineIndex
Uncut line.
◆ uncutLinePenIndex
 API_OpeningOutlinesParameters::uncutLinePenIndex
Uncut line pen.
◆ useLineOfCutElements
 API_OpeningOutlinesParameters::useLineOfCutElements
Use contours of cut elements.